---
type: TabbedDialogExtension
namespace: Autodesk.Revit.UI
version: 2024
members: 7
tags: [revit-api, class]
---

# TabbedDialogExtension

`Autodesk.Revit.UI.TabbedDialogExtension` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TabbedDialogExtension | 2013 | `public TabbedDialogExtension ( UserControl userControl , TabbedDialogAction onOK )` |
| Method | GetContextualHelp | 2013 | `public ContextualHelp GetContextualHelp ()` |
| Method | SetContextualHelp | 2013 | `public void SetContextualHelp ( ContextualHelp contextualHelp )` |
| Property | Control | 2013 | `public UserControl Control { get ; }` |
| Property | OnCancelAction | 2013 | `public TabbedDialogAction OnCancelAction { get ; set ; }` |
| Property | OnOKAction | 2013 | `public TabbedDialogAction OnOKAction { get ; }` |
| Property | OnRestoreDefaultsAction | 2013 | `public TabbedDialogAction OnRestoreDefaultsAction { get ; set ; }` |